app/Helpers/PurchaseHelper.php

select `value` from `site_settings` where `key` = 'purchase_completed' limit 1
---
    public static function isPurchaseCompleted(): bool
    {
        $settingJson = DB::table('site_settings')
            ->where('key', 'purchase_completed')
            ->value('value');